#Вариант2 
F = int(input('Введите число:'))
N = int(input('Введите второе число:'))
H = int(input('Введите трерье число:'))
B = F + N + H
V = B / 3
print(B, V) 
#Вариант9
F = int(input('Введите трехзначное число:'))
K = F // 100
L = (F //10) % 10 
J = F % 10 
print ( K, L, J)
#Вариант18 
n = int(input("Введите пятизначное число: "))

a = n // 10000
b = (n // 1000) % 10
c = (n // 100) % 10
d = (n // 10) % 10
e = n % 10

s = a + b + c + d + e
reverse = e * 10000 + d * 1000 + c * 100 + b * 10 + a

print("Сумма цифр:", s)
print("Обратное число:", reverse)
